
  #### plan-nodes-20251122T185839.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.k8s-test.google_dns_managed_zone_iam_member.cert_manager_dns01_public will be created
  + resource "google_dns_managed_zone_iam_member" "cert_manager_dns01_public" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + member       = "serviceAccount:sa-tiles-test-cert-manager@symm-custodes.iam.gserviceaccount.com"
      + project      = "symm-custodes"
      + role         = "roles/dns.admin"
    }

  # module.k8s-test.module.dns-public-zone.google_dns_managed_zone.public[0] will be created
  + resource "google_dns_managed_zone" "public" {
      + creation_time    = (known after apply)
      + description      = "Managed by Terraform"
      + dns_name         = "tiles-test.symmatree.com."
      + effective_labels = {
          + "cluster"                    = "tiles-test"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "cluster" = "tiles-test"
          + "name"    = "tiles-test"
        }
      + managed_zone_id  = (known after apply)
      + name             = "tiles-test"
      + name_servers     = (known after apply)
      + project          = "symm-custodes"
      + terraform_labels = {
          + "cluster"                    = "tiles-test"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles-test"
        }
      + visibility       = "public"

      + cloud_logging_config {
          + enable_logging = false
        }

      + dnssec_config (known after apply)
    }

  # module.k8s-test.module.dns-public-zone.google_dns_record_set.cloud-static-records["/NS"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "tiles-test.symmatree.com."
      + project      = "symm-custodes"
      + rrdatas      = [
          + "ns.tiles-test.symmatree.com.",
        ]
      + ttl          = 300
      + type         = "NS"
    }

  # module.k8s-test.module.dns-public-zone.google_dns_record_set.cloud-static-records["localhost/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "localhost.tiles-test.symmatree.com."
      + project      = "symm-custodes"
      + rrdatas      = [
          + "127.0.0.1",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.k8s-test.module.dns-public-zone.google_dns_record_set.cloud-static-records["ns/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles-test"
      + name         = "ns.tiles-test.symmatree.com."
      + project      = "symm-custodes"
      + rrdatas      = [
          + "127.0.0.1",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

  ```

  </details>
  
  